/**
 ****************************************************************************************************
 * @file        bsp_sensor_piezo.h
 * @author      Autumn
 * @version     V1.0
 * @date        2026-06-29
 * @brief       9号传感器 - 压电式振动传感器
 ****************************************************************************************************
 * @attention
 *
 * PA4 (ADC1_CH4) 模拟输入
 * 5次采样平均，输出电压 V
 *
 ****************************************************************************************************
 */

#ifndef __BSP_SENSOR_PIEZO_H
#define __BSP_SENSOR_PIEZO_H

#include "stm32f1xx_hal.h"

void bsp_piezo_init(void);
float bsp_piezo_read(void);

#endif
