/**
 ****************************************************************************************************
 * @file        bsp_sensor_fiber.h
 * @author      Autumn
 * @version     V1.0
 * @date        2026-06-29
 * @brief       11号传感器 - 光纤传感器
 ****************************************************************************************************
 * @attention
 *
 * PA5 (GPIO 输入，内部上拉，NPN 常开)
 * 低电平=检测到物体，高电平=无物体
 * 输出: 1.0=有物体, 0.0=无物体
 *
 ****************************************************************************************************
 */

#ifndef __BSP_SENSOR_FIBER_H
#define __BSP_SENSOR_FIBER_H

#include "stm32f1xx_hal.h"

void bsp_fiber_init(void);
float bsp_fiber_read(void);

#endif
