/**
 ****************************************************************************************************
 * @file        bsp_sensor_soil.h
 * @author      Autumn
 * @version     V1.0
 * @date        2026-06-29
 * @brief       14号传感器 - 土壤湿度传感器
 ****************************************************************************************************
 * @attention
 *
 * PA4 (ADC1_CH4) 模拟输入
 * 输出湿度百分比 (%)
 *
 ****************************************************************************************************
 */

#ifndef __BSP_SENSOR_SOIL_H
#define __BSP_SENSOR_SOIL_H

#include "stm32f1xx_hal.h"

void bsp_soil_init(void);
float bsp_soil_read(void);

#endif
