/**
 ****************************************************************************************************
 * @file        bsp_sensor_ds18b20.h
 * @author      Autumn
 * @version     V1.0
 * @date        2026-06-29
 * @brief       7号传感器 - DS18B20 温度传感器
 ****************************************************************************************************
 * @attention
 *
 * PA5 (单总线，推挽输出+浮空输入切换)
 * 测量范围: -55°C ~ +125°C
 * 输出: 温度值 °C
 *
 ****************************************************************************************************
 */

#ifndef __BSP_SENSOR_DS18B20_H
#define __BSP_SENSOR_DS18B20_H

#include "stm32f1xx_hal.h"

void bsp_ds18b20_init(void);
float bsp_ds18b20_read(void);

#endif
